# 3) შექმენით ცვლადი რომლის მნიშვნელობა იქნება lambda ფუნქცია, რომელიც დააჯამებს 2 რიცხვს. შემდეგ კი გამოიძახეთ ეს ფუნქცია

num = lambda a,b: a+b
print(num(5 , 5))
# 4) შექმენით ცვლადი რომლის მნიშვნელობა იქნება lambda ფუნქცია, რომელიც გაამრავლებს 2 რიცხვს. შემდეგ კი გამოიძახეთ ეს ფუნქცია.
num1 = lambda a,b: a*b
print(num1(5,5))

# 5) შექმენით ცვლადი რომლის მნიშვნელობა იქნება lambda ფუნქცია, რომელიც შეაერთებს 2 სტრინგს. შემდეგ კი გამოიძახეთ ეს ფუნქცია

num2 = lambda a,b: a+b
print(num2("irakli", "ikako"))