#Tuple-ში არ შეგვიძლია ინტეჯერებიდან, სტრინგებიდან, ბულინიდან და ა.ს.შ რომ ამოვიღოთ ასოები ან ჩავამატოთ ისენი როგორიცაა Pop, Append, და ა.ს.შ . 
#Tuple-ს სიტყვებს კი შეცვლა არ შეუძლიათ და ამას (უძრავ რაღაცეებს) ჰქვია constant.
#Tuple-ის და List-ის განსხვავებზე ვილაპარაკეთ ახლა კი მზგავს თვისებებზე ვილაპარაკოთ
#Tuple-ი და List-ი ერთმანეთში იმითი გავს რომ ორივეში ათვლა იწყება 0-იდან, კიდევ შეგვიძლია უარყოპითი ინდექსებიც გამოვიყენოთ ორივეში და ა.ს.შ


#Tuple არის შეუცვლელი ფუნქცია .
#List-ში სიტყვების ინტეჯერების სტრინგების ბულინების და ა.ს.შ შეცვლა შეგვიძლია
#Set-ში როცა დაწერ რამოდენიმე ფუნქციას და კოდს გაუშვებ ისევე არ გამოვე კოდი როგორც List-ში და Tuple-ში .
#დაწყებიდანვე უკვე დაიწყებს Set-ი სიტყვების არევას და ყოველ გაშვებაზე სხვადასხვა ნაირად დაიწყობა სიტყვები
#ხოლო მსგავსებები List-ში Set-ში და Tuple-ში არის ის რომ ყველას ათვლა იწყება 0-იდან, შეიძლება გამოიყენოს ნებისმიერი ფუნქცია და ა.ს.შ