# debbuging ნიშნავს დამხმარეს რომელიც ტერმინალში გვიჩვენებს თუ რა შეცდომა დავუშვით კოდში , მაგალითად :
city = "tbilisi"
print(city)
#ეს კოდი ჩვენ გამოგვიტანს Error-ს რადგან ჩვენ ცვლადის მნიშვნელობას დავაკელით ბრჭყალი რომლის გარეშეც კომპიუტერი ვერ აღიქვამს თუ რას ნიშნავს ეს. ამიტომაც debbuging არის დამხმარე რომელიც გვისწორებს შეცდომებს.
#(უბრალოდ ზევით ბრჭყალი დავამატე იმიტომ რომ დავალების სათაური წითლდებოდა*-*)
#ჩვენ კომენტარებს იმიტომ ვიყენებთ რომ ადამიანმა გაიგოს თუ რას ნიშნავს კოდი , ანუ ეს ადამიანისთვის ინსტრუქციაა , მაგრამ კომპიუტერი ამას ივიწყებს და ეს კოდის წერაში არასდროს არ შეგვიშლის ხელს.